<a href="https://colab.research.google.com/github/JuniorGunner/DataScienceFormation/blob/master/Pandas/Pandas_Class03.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Pandas Intro (Class 3)

## Relatório de Imóveis II
### Tipos de Imóveis

In [2]:
import pandas as pd
dados = pd.read_csv("aluguel.csv", sep=";")
dados.head(10)

          Tipo                   Bairro  Quartos  ...   IPTU  Valor m2  Tipo Agregado
0  Apartamento                   Centro        1  ...   20.0     53.33    Apartamento
1  Apartamento             Higienópolis        1  ...    0.0     16.67    Apartamento
2  Apartamento                 Cachambi        2  ...   17.0     26.00    Apartamento
3  Apartamento                   Grajaú        2  ...   74.0     21.43    Apartamento
4  Apartamento      Lins de Vasconcelos        3  ...   14.0     16.67    Apartamento
5  Apartamento               Copacabana        1  ...   50.0     50.00    Apartamento
6  Apartamento  Freguesia (Jacarepaguá)        3  ...   28.0     17.59    Apartamento
7  Apartamento          Barra da Tijuca        2  ...  147.0     25.37    Apartamento
8  Apartamento                   Tijuca        2  ...  138.0     17.27    Apartamento
9  Apartamento                   Olaria        3  ...    0.0     14.71    Apartamento

[10 rows x 11 columns]

In [3]:
dados["Tipo"].head()

0    Apartamento
1    Apartamento
2    Apartamento
3    Apartamento
4    Apartamento
Name: Tipo, dtype: object

In [4]:
tipo_imoveis = dados["Tipo"]
type(tipo_imoveis)

pandas.core.series.Series

In [5]:
tipo_imoveis.drop_duplicates(inplace = True) # inplace True modifies the variable
tipo_imoveis

0               Apartamento
16923                  Casa
17821    Casa de Condomínio
18785          Casa de Vila
19018             Quitinete
Name: Tipo, dtype: object

### Organizando a visualização

In [6]:
tipo_imoveis = pd.DataFrame(tipo_imoveis)
tipo_imoveis

                     Tipo
0             Apartamento
16923                Casa
17821  Casa de Condomínio
18785        Casa de Vila
19018           Quitinete

In [7]:
tipo_imoveis.index

Int64Index([0, 16923, 17821, 18785, 19018], dtype='int64')

In [8]:
tipo_imoveis.shape[0]

5

In [9]:
""" Fixing index """
tipo_imoveis.index = range(tipo_imoveis.shape[0])
tipo_imoveis

                 Tipo
0         Apartamento
1                Casa
2  Casa de Condomínio
3        Casa de Vila
4           Quitinete

In [10]:
""" Index column name """
tipo_imoveis.columns.name = "Id"
tipo_imoveis

Id                Tipo
0          Apartamento
1                 Casa
2   Casa de Condomínio
3         Casa de Vila
4            Quitinete

## Extras - Criando estruturas de dados

In [11]:
data = [1, 2, 3, 4, 5]
s = pd.Series(data)
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [13]:
index = ['Linha' + str(i) for i in range(5)]
index

['Linha0', 'Linha1', 'Linha2', 'Linha3', 'Linha4']

In [14]:
s = pd.Series(data = data, index = index)
s

Linha0    1
Linha1    2
Linha2    3
Linha3    4
Linha4    5
dtype: int64

* Using Dictionary:

In [15]:
data = {'Linha' + str(i) : i + 1 for i in range(5)}
data

{'Linha0': 1, 'Linha1': 2, 'Linha2': 3, 'Linha3': 4, 'Linha4': 5}

In [17]:
s = pd.Series(data)
s

Linha0    1
Linha1    2
Linha2    3
Linha3    4
Linha4    5
dtype: int64

* Series operations:

In [18]:
s1 = s + 2
s1

Linha0    3
Linha1    4
Linha2    5
Linha3    6
Linha4    7
dtype: int64

In [20]:
s2 = s + s1
s2

Linha0     4
Linha1     6
Linha2     8
Linha3    10
Linha4    12
dtype: int64

## Concatenando Dataframes

In [22]:
data = [
    [1, 2, 3],
    [4, 5, 6],
    [7, 8, 9]
]

df1 = pd.DataFrame(data = data)
df1

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [23]:
index = ['Linha' + str(i) for i in range(3)]
index

['Linha0', 'Linha1', 'Linha2']

In [25]:
df1 = pd.DataFrame(data = data, index = index)
df1

        0  1  2
Linha0  1  2  3
Linha1  4  5  6
Linha2  7  8  9

In [26]:
columns = ['Coluna' + str(i) for i in range(3)]
columns

['Coluna0', 'Coluna1', 'Coluna2']

In [27]:
df2 = pd.DataFrame(data = data, index = index, columns = columns)
df2

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

In [28]:
data = {'Coluna0': {'Linha0': 1, 'Linha1': 4, 'Linha2': 7},
        'Coluna1': {'Linha0': 2, 'Linha1': 5, 'Linha2': 8},
        'Coluna2': {'Linha0': 3, 'Linha1': 6, 'Linha2': 9}}

data

{'Coluna0': {'Linha0': 1, 'Linha1': 4, 'Linha2': 7},
 'Coluna1': {'Linha0': 2, 'Linha1': 5, 'Linha2': 8},
 'Coluna2': {'Linha0': 3, 'Linha1': 6, 'Linha2': 9}}

In [29]:
df3 = pd.DataFrame(data = data)
df3

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

In [31]:
df1[df1 > 0] = 'A'
df1

        0  1  2
Linha0  A  A  A
Linha1  A  A  A
Linha2  A  A  A

In [32]:
df2[df2 > 0] = 'B'
df2

       Coluna0 Coluna1 Coluna2
Linha0       B       B       B
Linha1       B       B       B
Linha2       B       B       B

In [33]:
df3[df3 > 0] = 'C'
df3

       Coluna0 Coluna1 Coluna2
Linha0       C       C       C
Linha1       C       C       C
Linha2       C       C       C

In [34]:
df4 = pd.concat([df1, df2, df3])
df4

          0    1    2 Coluna0 Coluna1 Coluna2
Linha0    A    A    A     NaN     NaN     NaN
Linha1    A    A    A     NaN     NaN     NaN
Linha2    A    A    A     NaN     NaN     NaN
Linha0  NaN  NaN  NaN       B       B       B
Linha1  NaN  NaN  NaN       B       B       B
Linha2  NaN  NaN  NaN       B       B       B
Linha0  NaN  NaN  NaN       C       C       C
Linha1  NaN  NaN  NaN       C       C       C
Linha2  NaN  NaN  NaN       C       C       C

In [35]:
df4 = pd.concat([df1, df2, df3], axis = 1)
df4

        0  1  2 Coluna0 Coluna1 Coluna2 Coluna0 Coluna1 Coluna2
Linha0  A  A  A       B       B       B       C       C       C
Linha1  A  A  A       B       B       B       C       C       C
Linha2  A  A  A       B       B       B       C       C       C

* Exercises:

In [36]:
df1 = pd.DataFrame({'A': {'X': 1}, 'B': {'X': 2}})
df2 = pd.DataFrame({'C': {'X': 3}, 'D': {'X': 4}})
pd.concat([df1, df2])

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:3: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  This is separate from the ipykernel package so we can avoid doing imports until

     A    B    C    D
X  1.0  2.0  NaN  NaN
X  NaN  NaN  3.0  4.0

In [37]:
dados = [('A', 'B'), ('C', 'D')]
df = pd.DataFrame(dados, columns = ['L1', 'L2'],  index = ['C1', 'C2'])
df

   L1 L2
C1  A  B
C2  C  D

In [38]:
dados = [[1, 2, 3], [4, 5, 6]]
index = 'X,Y'.split(',')
columns = list('CBA')[::-1]
df = pd.DataFrame(dados, index, columns)
df

   A  B  C
X  1  2  3
Y  4  5  6

In [39]:
dados = {'A': {'X': 1, 'Y': 3}, 'B': {'X': 2, 'Y': 4}}
df = pd.DataFrame(dados)
df

   A  B
X  1  2
Y  3  4